sdaiGetADBValue(Sdai_ADBId*,SdaiPrimitiveType,System.Void*)
\details
Gets the value from the ADB.
\param block [in] the ADB instance.
\param valueType [in] value type.
\param value [in/out] pointer to buffer to write result.
\returns Returns pointer to the value in success, otherwise returns NULL.